{
  "objects": [
    {
      "name": "Chata",
      "position": {
        "lat": 17.378869,
        "long": 52.527116
      },
      "model": {
        "meta": {
          "name": "cottageClear",
          "path": "Cottage",
          "textureImage": "cottage_texture.png",
          "scale": "8.0"
        },
        "mesh": [
          {
            "name": "parter_1"
          },
          {
            "name": "Belki_1"
          },
          {
            "name": "dach1_1"
          },
          {
            "name": "dach2_1"
          }
        ]
      },
      "details": {
        "description": "Chata chłopska okresu wczesnopiastowskiego",
        "icon": "ic_action_cottage",
        "foto": "chatka_foto",
        "information": [
          {
            "name": "Podgrodzie",
            "text": "Jednolitą przestrzeń wnętrza grodu podzielono na gród wewnętrzny, dodatkowo umacniany, przeznaczony dla pana grodowego i jego drużyny oraz gród właściwy, zamieszkany przez ludność rzemieślniczo-kupiecką. Właśnie na podgrodziu skupione były różne rzemiosła, co pociągało za sobą ustalenie w tym miejscu targu, ściągającego nie tylko okoliczną ludność rolnicza, ale i zawodowych kupców obsługujących oddalone od siebie dzielnice i kraje. Rzemiosłu stwarzało to warunki, aby produkować już nie tylko na konkretne zamówienie, lecz na rynek dla nieznanego odbiorcy.",
            "image": "chatka_foto.jpg"
          },
          {
            "name": "Budownictwo",
            "text": "Domy naziemne w konstrukcji w zrąb budowano w strefie leśnej lub wszędzie tam, gdzie słaba spoistość podłoża nie pozwalała na zagłębienie chaty. Słowianie znali też konstrukcję słupową, w której między słupami ścian znajdowała się plecionka oblepiona gliną. Jedynym śladem takich konstrukcji są często owalne, płytkie jamy z paleniskami. Konstrukcja naziemna – zrębowa i słupowa – wymagała specjalnego przygotowania więźby dachowej. W tym celu stosowano sochy lub półsuchy, podtrzymujące od strony ścian szczytowych belkę, do której przymocowuje się krokwie. Dach pokrywano trzciną lub słomą. Domy naziemne budowano bez podpiwniczenia, choć często zaopatrywano w podłogi z dranic bądź wylepiano ich powierzchnie gliną. Maksymalny czas użytkowania takich konstrukcji wynosił około 25 lat.",
            "image":"chatka.png"
          },
          {
            "name": "Przypis",
            "text": "Teksty pochodzą z strony http://stara.loplonsk.pl/gazszk/piast.pdf"
          }
        ]
      }
    },
    {
      "name": "Grób pielgrzyma",
      "position": {
        "lat": 17.37759,
        "long": 52.52590
      },
      "model": {
        "meta": {
          "name": "cross",
          "path": "Compostela",
          "scale": "1.5"
        },
        "mesh": [
          {
            "name": "cross"
          }
        ]
      },
      "details": {
        "description": "Odnalezienie na ostrowie lednickim muszli pielgrzyma, będącej znakiem ludzi udających się do Santiago de Compostela",
        "icon": "ic_action_compostela",
        "foto": "pielgrzym_foto",
        "information": [
          {
            "name": "Santiago de Compostella",
            "text": "Miejscowość znajdująco się w Hiszpanni opodal wybrzeża Oceanu Atlantyckiego. Jest miejscem pochówku św. Jakuba Większego, będącego uczniem Jezusa Chrystusa. Z tego powodu Od wczesnego średniowiecza miejsce to jest celem licznych pielgrzymek. Ludzie docierający do Santiago otrzymywali w nagrodę muszlę. Odnalezienie owej charakterystycznej muszli w grobie na Ostrowie Lednickim pozwala domniemywać, że osoba pochowana w tym miejscu musiała za życia dotrzeć do grobu św Jakuba."
          },
          {
            "name": "Krzyż św. Jakuba",
            "text": "Sw. Jakub Większy ponisł śmierć męczęńską poprzez ucięcie głowy. Z tego powodu krzyż św. Jakuba przypomina kształtem miecz o raminach zakończonych kwiatami lilii. Kwiaty te symbolizują świętość. Oprócz muszli krzyż ten stał się symbolem piegrzymów podążających do Santiag de Compostela. "
          }
        ]
      }
    },
    {
      "name": "Kościół",
      "position": {
        "lat": 17.377378,
        "long": 52.5263
      },
      "model": {
        "meta": {
          "name": "kosciol-lednica-ostateczny",
          "path": "Church",
          "textureImage": "kosciol_tekstura.png",
          "scale": "11.0"
        },
        "mesh": [
          {
            "name": "Cube"
          }
        ]
      },
      "details": {
        "description": "Kammieny kościół grodowy",
        "icon": "ic_action_church",
        "foto": "kosciol_foto",
        "information": [
          {
            "name": "Opis",
            "text": "Wzniesiony został z otoczaków kamiennych w północnej części grodu, w pobliżu bramy prowadzącej do jego wnętrza. Orientowany, jednonawowy (długości 13,5 m), z prostokątnym prezbiterium i dwoma aneksami od północy, ma we wnętrzu dwa kamienne grobowce, prawdopodobnie miejsca ostatniego spoczynku synów Bolesława Chrobrego. Kościół ten można zaliczyć do jednej z pierwszej nekropolii książęcych na ziemiach polskich."
          },
          {
            "name": "Przypisy",
            "text": "Informacje zostały zacytowane z strony https://pl.wikipedia.org/wiki/Ostr%C3%B3w_Lednicki"
          }
        ]
      }
    },
    {
      "name": "Wał grodu",
      "position": {
        "lat": 17.37668,
        "long": 52.526548
      },
      "model": {
        "meta": {
          "name": "wall-lednica-ostateczny-przegladarka",
          "path": "Wall",
          "textureImage": "wall-tekstura2.png",
          "scale": "8.0"
        },
        "mesh": [
          {
            "name": "Cylinder_1"
          },
          {
            "name": "Cylinder_2"
          },
          {
            "name": "Cylinder_3"
          },
          {
            "name": "Cylinder_4"
          },
          {
            "name": "Cylinder_5"
          },
          {
            "name": "Cylinder_6"
          },
          {
            "name": "Cylinder_7"
          },
          {
            "name": "Cylinder_8"
          },
          {
            "name": "Cylinder_9"
          },
          {
            "name": "Cylinder_10"
          },
          {
            "name": "Cylinder_11"
          },
          {
            "name": "Cylinder_12"
          },
          {
            "name": "Cylinder_13"
          }
        ]
      },
      "details": {
        "description": "Pozostałości wału obronnego grodu",
        "icon": "ic_action_wall",
        "foto": "wal_foto",
        "information": [
          {
            "name": "Opis",
            "text": "Grube bierwiona układało się warstwami ciasno, jedna na drugiej. Kłody pierwszej miały położenie poprzeczne w stosunku do kierunku biegu samego wału, belki warstwy drugiej, wyższej, leżały doń równolegle i tak dalej, i dalejaż do wysokości dziesięciu lub dwunastu metrów. Puste przestrzenie między tramami wypełniało się ubitą ziemią i kamieniami. Na samym wierzchu zwężającego się ku górze wału mógł stanąć szereg skrzyń-izbic, wypełnionychgłazami albo zwarty częstokół. Nieprzerwany a pochyły płot z zaostrzonychpali bronił jeszcze przystępu do umocnienia od zewnątrz. Na samym dole wały mogły sięgać do dwudziestu metrów szerokości."
          },
          {
            "name": "Udoskonalenia",
            "text": "Później - około połowy X w. - wprowadzono dodatkowe udoskonalenie. Polegało ono na tym, że niektóre, w regularnych odstępach umieszczone kłody poprzeczne miały haki-zaczepy, mocno przytrzymujące belki warstwy wyższej i uniemożliwiające ich wysunięcie się. Zaczep powstawał po prostu zodpowiednio przyciętego konara drzewa, zawczasu na ten cel wybranego. Hak nie mógł odpaść ani puścić, bo był przecież zrośnięty z kłodą, stanowiącą częśćskładową samego wału."
          },
          {
            "name": "Przypis",
            "text": "Teksty zacytowane z książki Polska Piastów autorstwa Pawła Jasienicy"
          }
        ]
      }
    },
    {
      "name": "Palatium",
      "position": {
        "lat": 17.37668,
        "long": 52.526548
      },
      "model": {
        "meta": {
          "name": "palatium-lednica-ostateczny-przegladarka",
          "path": "Palatium",
          "textureImage": "palatium-tekstura.png",
          "scale": "4.0"
        },
        "mesh": [
          {
            "name": "Cube"
          }
        ]
      },
      "details": {
        "description": "Pozostałości wału obronnego grodu",
        "icon": "ic_action_palatium",
        "foto": "palatium_foto",
        "information": [
          {
            "name": "Opis",
            "text": "Stara legenda głosi, że Bolesław Chrobry ujrzał światło dzienne na OstrowieJeziora Lednickiego w Wielkopolsce. Najpóźniej na przełomie X i XI stuleciastanął tam kamienny kościół chrześcijański i zbudowany z tegoż samegomateriału (a po części nawet ze sztucznego kamienia) piętrowy zamek, kryty ołowianymi płytkami. Zdobiący ściany jasny tynk, wskutek przymieszkitlenku żelaza, pod działaniem wilgoci nabierał zabarwienia różowego. Ruiny tych gmachów istnieją, mnóstwo ludzi je oglądało, zanim archeologowie wykryli ich dawną świetność."
          },
          {
            "name": "Przypis",
            "text": "Teksty zacytowane z książki Polska Piastów autorstwa Pawła Jasienicy"
          }
        ]
      }
    }
  ]
}
